Добро пожаловать в IPython Notebook
--------------------------

Данный notebook печатает классическое `"Hello world!`.

Для запуска блока команд, нажмите на него, и используйте SHIFT+ENTER

Также есть дополнительные keyboard hotkeys (описанные в меню Help)

Проверим, что у вас подключена возможность работы с SQL

In [24]:
%load_ext sql
%sql sqlite:///tst_1.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @tst_1.db'

Однострочный SQL-запрос

In [25]:
%sql SELECT 1

 * sqlite:///tst_1.db
Done.

[(1,)]

Многострочный SQL-запрос

In [26]:
%%sql
SELECT 1
UNION
SELECT 2

 * sqlite:///tst_1.db
Done.

[(1,), (2,)]

Создадим таблицу Факультетов со следующими полями:
1. fac_id - уникальный идентификатор факультета
2. Name - Имя факультета

In [38]:
%%sql

DROP TABLE IF EXISTS Faculties;
CREATE TABLE Faculties 
(
    fac_id INTEGER PRIMARY KEY, 
    Name VARCHAR(50)
);

 * sqlite:///tst_1.db
Done.
Done.

[]

Проверим, что таблица создана

In [39]:
%sql SELECT * from Faculties

 * sqlite:///tst_1.db
Done.

[]

Заполним таблицу данными

In [41]:
%%sql
INSERT INTO Faculties(fac_id, name) VALUES (1, 'KIB');
INSERT INTO Faculties(fac_id, name) VALUES (2, 'IT');
INSERT INTO Faculties(fac_id, name) VALUES (3, 'Economics');

 * sqlite:///tst_1.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

SQLite требует включение поддержки внешних ключей.
Более подробно можно посмотреть [здесь](https://sqlite.org/foreignkeys.html)

In [42]:
%%sql
PRAGMA foreign_keys = ON;

 * sqlite:///tst_1.db
Done.

[]

Создадим таблицу Студентов со следующими полями:
1. Student_id - уникальный идентификатор студента
2. Name - имя студента
3. Second Name - фамилия студенты
4. Faculty - факультет студента
5. StudyGroup - группа студента 
6. GPA - средний балл

In [44]:
%%sql 
drop table if exists Students;

CREATE TABLE Students 
(
    student_id INTEGER PRIMARY KEY, 
    Name VARCHAR(50),
    SecondName VARCHAR(50), 
    Faculty_id INTEGER ,
    StudyGroup VARCHAR(20),
    GPA NUMBER,
    FOREIGN KEY(faculty_id) REFERENCES Faculties(fac_id)
);

 * sqlite:///tst_1.db
Done.
Done.

[]

Проверим, что таблица создана

In [45]:
%sql SELECT * from Students

 * sqlite:///tst_1.db
Done.

[]

Заполним таблице данными

In [46]:
%%sql
INSERT INTO Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (1, 'Anton', 'Sidorov', 1, '101', 3.5);
INSERT INTO Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (2, 'Alexey', 'Petrov', 2, '201', 3.3);
INSERT INTO Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (3, 'Ivan', 'Meshkov', 1, '101', 4.5);
INSERT INTO Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (4, 'Elena', 'Kvitova', 3, '301', 4.8);
INSERT INTO Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (5, 'Darya', 'Salnikova', 2, '202', 3.4);

 * sqlite:///tst_1.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Проверим наличие данных

In [47]:
%sql SELECT * from Students

 * sqlite:///tst_1.db
Done.

[(1, 'Anton', 'Sidorov', 1, '101', 3.5),
 (2, 'Alexey', 'Petrov', 2, '201', 3.3),
 (3, 'Ivan', 'Meshkov', 1, '101', 4.5),
 (4, 'Elena', 'Kvitova', 3, '301', 4.8),
 (5, 'Darya', 'Salnikova', 2, '202', 3.4)]

## Задание 1. Напишите SQL-запрос, возвращающий ваше имя

In [48]:
%sql SELECT "Мишан"

 * sqlite:///tst_1.db
Done.

[('Мишан',)]

## Задание 2. Напишите SQL-запрос, возвращающий имена всех студентов с фамилией Sidorov

In [49]:
%%sql
SELECT Name
FROM students
WHERE secondName = "Sidorov"

 * sqlite:///tst_1.db
Done.

[('Anton',)]

## Задание 3. Выведите все названия факультетов, на которых учится хотя бы один студент со средним баллом не менее 4. Имя факультета должно встречаться один раз в выводе

In [51]:
%%sql
SELECT DISTINCT Faculties.name
FROM Students, Faculties
WHERE (fac_id = Faculty_id) AND (GPA >= 4)

 * sqlite:///tst_1.db
Done.

[('KIB',), ('Economics',)]

## Задание 4. Вывести только тех студентов, фамилия которых начинается с 'S', а в имени присутствует 'a'.

In [52]:
%%sql
SELECT *
FROM Students
WHERE (Name LIKE "%a%") AND (SecondName LIKE "S%") AND NOT(Name LIKE "A%")

 * sqlite:///tst_1.db
Done.

[(5, 'Darya', 'Salnikova', 2, '202', 3.4)]

## Задание 5. Вывести только те факультеты, количество групп в которых больше 3

In [53]:
%%sql
INSERT INTO Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (6,'Mishan', 'Aliev', 2, '203', 5.0);
INSERT INTO Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (7,'Misha', 'Aviev', 2, '204', 4.7);
INSERT INTO Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (8,'Masha', 'Aeva', 2, '205', 4.3);
INSERT INTO Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (9,'Maria', 'Weva', 2, '205', 5.2);

SELECT * from Students

 * sqlite:///tst_1.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Anton', 'Sidorov', 1, '101', 3.5),
 (2, 'Alexey', 'Petrov', 2, '201', 3.3),
 (3, 'Ivan', 'Meshkov', 1, '101', 4.5),
 (4, 'Elena', 'Kvitova', 3, '301', 4.8),
 (5, 'Darya', 'Salnikova', 2, '202', 3.4),
 (6, 'Mishan', 'Aliev', 2, '203', 5),
 (7, 'Misha', 'Aviev', 2, '204', 4.7),
 (8, 'Masha', 'Aeva', 2, '205', 4.3),
 (9, 'Maria', 'Weva', 2, '205', 5.2)]

In [54]:
%%sql
SELECT * 
FROM Faculties

 * sqlite:///tst_1.db
Done.

[(1, 'KIB'), (2, 'IT'), (3, 'Economics')]

In [56]:
%%sql
SELECT Faculties.name
FROM Faculties
JOIN Students ON Students.Faculty_id = Faculties.fac_id
GROUP BY Faculties.name, Faculties.fac_id
HAVING COUNT(DISTINCT Students.StudyGroup) > 3

 * sqlite:///tst_1.db
Done.

[('IT',)]

## Задание 6. Для всех факультетов вывести средний балл по факультету для студентов, чья фамилия не содержит в себе подстроку 'ov', при условии, что количество таких студентов на факультете не менее 3. В обратном случае, факультет выводить не требуется

 http://2sql.ru/

In [57]:
%%sql
SELECT Faculties.name, AVG(GPA)
FROM Faculties
JOIN Students ON Students.Faculty_id = Faculties.fac_id
WHERE Students.SecondName NOT LIKE "%ov%"
GROUP BY Faculties.fac_id, Faculties.name
HAVING COUNT(DISTINCT Students.name) >= 3

 * sqlite:///tst_1.db
Done.

[('IT', 4.8)]